<?php
/**
 * 常规操作0-300
 * 系统级别301-600
 * 其它问题600+
 */

return [
    // core
    -3 => '欢迎使用 Nine Aspects framework (NA)',
    -2 => '数据错误',
    -1 => '错误',
    0 => '失败',
    1 => '配置不存在',
    2 => '控制器不存在',
    3 => '函数或方法不存在',
    4 => '模块不存在',
    5 => '不支持的类型',
    6 => '文件加载失败',
    7 => '参数非法',
    8 => '编码不存在',
    9 => '文件不存在',

    // verifySign
    20 => '发送的数据签名不存在',
    21 => '发送的数据参数不合法',
    22 => '验证失效,请重新发送请求',
    23 => '验证通过',
    24 => '请求不合法',

    // data
    100 => '数据为空',
    101 => '数据存在',
    200 => '成功',

    // ext
    600 => '没有启用COOKIE',
    601 => '没有启用SESSION',
];
