<?php

/**
 * 常规操作0-300
 * 系统级别301-600
 * 其它问题600+
 */

return [
    // core
    -3 => '歡迎使用  Nine Aspects framework (NA)',
    -2 => '數據錯誤',
    -1 => '错误',
    0 => '失敗',
    1 => '配寘不存在',
    2 => '控制器不存在',
    3 => '函數或方法不存在',
    4 => '模块不存在',
    5 => '不支援的類型',
    6 => '檔案加載失敗',
    7 => '參數非法',
    8 => '編碼不存在',
    9 => '檔案不存在',

    // verifySign
    20 => '發送的數據簽名不存在',
    21 => '發送的數據參數不合法',
    22 => '驗證失效，請重新發送請求',
    23 => '驗證通過',
    24 => '請求不合法',

    // data
    100 => '數據為空',
    101 => '數據存在',
    200 => '成功',

    // ext
    600 => '沒有啟用COOKIE',
    601 => '沒有啟用SESSION',
];
